gcc -g p2final.c
 ./a.out
enter the values for the sides of triangle
6
enter the values for the sides of triangle
7
enter the values for the sides of triangle
8
is a scalene triangle
 gdb a.out
GNU gdb (Ubuntu 8.1.1-0ubuntu1) 8.1.1
Copyright (C) 2018 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "x86_64-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
<http://www.gnu.org/software/gdb/documentation/>.
For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from a.out...done.
(gdb) b main
Breakpoint 1 at 0x7e0: file p2final.c, line 31.
(gdb) r
Starting program: /home/runner/IA2-Test1-Session2/a.out 
warning: Error disabling address space randomization: Operation not permitted

Breakpoint 1, main () at p2final.c:31
31    a=input_side();
(gdb) n
enter the values for the sides of triangle
3
32    b=input_side();
(gdb) n
enter the values for the sides of triangle
4
33    c=input_side();
(gdb) n
enter the values for the sides of triangle
5
34    isscalene=check_scalene(a,b,c);
(gdb) n
35    output(a,b,c,isscalene);
(gdb) p a
$1 = 3
(gdb) p b
$2 = 4
(gdb) p c
$3 = 5
(gdb) p isscalene
$4 = 1
(gdb) n
is a scalene triangle
36    return 0;
(gdb) n
37  }
(gdb)