gcc -g p7final.c
 ./a.out
Enter the values for the base and altitude
2
3
3.000000 is the area of the triangle
 gdb a.out
GNU gdb (Ubuntu 8.1.1-0ubuntu1) 8.1.1
Copyright (C) 2018 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "x86_64-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
<http://www.gnu.org/software/gdb/documentation/>.
For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from a.out...done.
(gdb) b main
Breakpoint 1 at 0x865: file p7final.c, line 24.
(gdb) r
Starting program: /home/runner/IA2-Test1-Session2/a.out 
warning: Error disabling address space randomization: Operation not permitted

Breakpoint 1, main () at p7final.c:24
24  {
(gdb) s
26    t=input_triangle();
(gdb) n
Enter the values for the base and altitude
4
6
27    find_area(&t);
(gdb) n
28    output(t);
(gdb) p t.base
$1 = 4
(gdb) p t.altitude
$2 = 6
(gdb) n
12.000000 is the area of the triangle
29    return 0;
(gdb) p t.area
$3 = 12